{
  "project1Name": "Mon Budget Perso",
  "project1ShortDescription": "De Excel en 2016 à une application web en 2023 : découvrez Mon Budget Perso, le reflet de mon évolution en développement web.",
  "project1LongDescription": "Mon projet personnel, initié en 2016 sous le nom de Gestion des Comptes Personnels avec un outil Excel pour la gestion de mes finances, s'est métamorphosé en juillet 2023 en une application web, désormais baptisée Mon Budget Perso.\n\nCette évolution marque le fruit de mes efforts autodidactes, magnifiés par une formation en développement web axée principalement sur le front-end. Cette transition illustre ma progression et ma capacité à appliquer de façon tangible les compétences acquises.\n\nL'achèvement de la Version Web 1.0.0 pendant ma formation représente une concrétisation de cet apprentissage. J'ai conçu et développé entièrement ce projet, du front-end au back-end, et assure son hébergement sur mon serveur NAS personnel.\n\nCette démarche témoigne de mon engagement total et de ma polyvalence dans tous les aspects du développement. Parcourez cette frise chronologique pour voir l'évolution de Mon Budget Perso et découvrir les diverses compétences que j'ai développées en cours de route.",
  "project1Image1Title": "Vue de l'écran de connexion",
  "project1Image2Title": "Vue de l'écran Liste Saisie - Tous les comptes",
  "project1Image3Title": "Vue de l'écran Liste Saisie - Compte xxxx",
  "project1Image4Title": "Vue de l'écran Création d'écriture comptable",
  "project1Chrono1Title": "Fichier Excel avec des formules",
  "project1Chrono1Description": "La version 1.0.0 est un simple fichier Excel doté de formules complexes pour la gestion mensuelle des revenus et dépenses.",
  "project1Chrono1Image1Title": "Vue de l'écran de connexion Excel",
  "project1Chrono2Title": "Utilisation de macros avec userforms et connexion à une base de données Access.",
  "project1Chrono2Description": "La version 1.1.0 marque un tournant majeur, transformant l'application en un projet Excel avancé relié à une base de données Access structurée avec environ 40 tables. Cette mise à jour introduit une collaboration à deux, consolidant toutes les fonctionnalités nécessaires pour une gestion efficace.",
  "project1Chrono2Image1Title": "Vue de l'écran de connexion",
  "project1Chrono3Title": "Conversion en format web pour pratiquer mes acquis, utilisation de HTML-SASS-JS pour le Front-End et PHP/MySQL pour le Back-End.",
  "project1Chrono3Description": "La version 0.1 initie le passage du projet à une plateforme web, en exploitant HTML, SASS, JS pour le front-end et PHP/MySQL pour le back-end, basée sur la structure originelle de la version Excel. Cette étape marque le début de l'application de mes connaissances en développement web sur un projet concret, avec une mise en œuvre des fonctionnalités essentielles.",
  "project1Chrono3Image1Title": "Vue de l'écran de connexion",
  "project1Chrono4Title": "Migration vers React avec Vite.js et création d'une API pour le Back-End.",
  "project1Chrono4Description": "La version 0.5 transforme l'application grâce à l'adoption de React et Vite.js, optimisant l'interface utilisateur et la performance globale. Les écrans principaux ont été redéveloppés, intégrant uniquement les fonctionnalités essentielles, et une API pour le back-end a été mise en place. Une nouveauté majeure est l'introduction de Redux, choisie après une évaluation approfondie de son impact face à la complexité des données comptables. Ce choix stratégique, résultat de tests comparatifs avec et sans Redux, assure une gestion d'état plus efficace et une meilleure maintenabilité du projet.",
  "project1Chrono4Image1Title": "Vue de l'écran de connexion",
  "project1Chrono5Title": "Transformation de API PHP en API avec le framework Laravel.",
  "project1Chrono5Description": "La version 0.8 marque le passage de notre API de PHP pur à Laravel, améliorant la sécurité et l'efficacité avec Axios pour les requêtes. Cette évolution a renforcé notre back-end et conservé une gestion d'état cohérente avec Redux. Un défi notable a été le déploiement de l'API sur mon NAS personnel, nécessitant une adaptation technique spécifique pour assurer une intégration fluide et sécurisée.",
  "project1Chrono5Image1Title": "Vue de l'écran de connexion",
  "project1Chrono6Title": "Version de démonstration",
  "project1Chrono6Description": "La Version Web 1.0.0 est ma première version de démonstration publique, présentant une interface utilisateur interactive conçue avec React et des performances améliorées grâce à Vite.js. Cette version initie les fonctionnalités essentielles pour une gestion efficace, permettant la création, modification, et suppression de saisies manuelles ou récurrentes. Bien que l'ensemble des fonctionnalités de la version Excel originale ne soient pas encore implémentées, cette itération repose sur une architecture back-end robuste via Laravel, et une gestion d'état optimisée avec Redux. C'est un pas important qui démontre la viabilité et le potentiel de l'application web pour une utilisation concrète. Le travail continue pour enrichir cette plateforme et intégrer progressivement toutes les fonctionnalités envisagées.",
  "project1Chrono6Image1Title": "Vue de l'écran de connexion",
  "featureBankAccountManagementTitle": "Gestion de comptes bancaires personnels",
  "featureBankAccountManagementDescription": "Jusqu'à 5 comptes de types : Courant - Différé - Joint et 5 comptes Épargne.",
  "featureJointAccountTitle": "Compte Joint",
  "featureJointAccountDescription": "Utilisable par les utilisateurs définis, tandis que les autres comptes sont individuels.",
  "featureAccountingEntriesTitle": "Saisies d'écritures comptables",
  "featureAccountingEntriesDescription": "De Revenus ou de Dépenses.",
  "featureAccountReconciliationTitle": "Pointage des écritures comptables",
  "featureAccountReconciliationDescription": "Possibilité de pointer les écritures pour réaliser son rapprochement bancaire.",
  "featureEntriesSharingTitle": "Partage des écritures",
  "featureEntriesSharingDescription": "Entre 2 utilisateurs.",
  "featureEntriesValidationTitle": "Validation des écritures",
  "featureEntriesValidationDescription": "Validation des écritures sur une période après rapprochement bancaire et réalisation de clôtures d'exercices.",
  "featureAccountClosureTitle": "Clôture de l'Exercice Comptable",
  "featureAccountClosureDescription": "Sur une période après rapprochement bancaire et réalisation de clôtures d'exercices.",
  "comingSoon": "À venir",
  "entryTypeTitle": "Type de saisie",
  "entryTypeDescription": "Revenus ou Dépenses.",
  "categoriesTitle": "Catégories",
  "categoriesDescription": "Groupe, Catégorie (rattachée à un Compte), Sous-Catégorie, Détail.",
  "recurringEntriesTitle": "Écritures récurrentes",
  "recurringEntriesDescription": "Possibilité de définir des écritures récurrentes et des prélèvements automatiques.",
  "automaticTransfersTitle": "Transferts automatiques",
  "automaticTransfersDescription": "Création d'écritures automatiques entre 2 comptes existants dans le logiciel (même utilisateur ou différent).",
  "sharingStatusTitle": "Statut du Partage",
  "sharingStatusDescription": "Tableau de suivi et éléments de type Commandes",
  "reconciliationStatusTitle": "Statut du Rapprochement Bancaire",
  "reconciliationStatusDescription": "Tableau de suivi et éléments de type Commandes",
  "healthSpendingTrackingTitle": "Suivi des dépenses liés à la Santé",
  "healthSpendingTrackingDescription": "Tableau de suivi et éléments de type Santé pour vérifier les remboursements.",
  "provisionsTrackingTitle": "Suivi des Provisions",
  "provisionsTrackingDescription": "Tableau de suivi et éléments de type Provisions",
  "ordersTrackingTitle": "Suivi des Commandes",
  "ordersTrackingDescription": "Tableau de suivi et éléments de type Commandes",
  "project1demonstrationText": "Je peux vous faire une démonstration de l'outil, vous donner les paramètres de connexion pour un compte test ou vous donner accès à mon code via GitHub.",
  "apiDocumentationTitle": "Voir la documentation de l'API",
  "projectVersionTitle": "Voir la version (Vite.js + Redux + API Laravel)",
  "githubCodeTitle": "Code sur GitHub",
  "project2Name": "Optimisation du Processus de Migration de Données",
  "project2ShortDescription": "De l'automatisation de processus en VBA à la création d'un outil web en PHP, ce projet incarne mon initiation au développement et ma transition vers une carrière en développement web, soulignant ma capacité à innover et à me réinventer professionnellement.",
  "project2LongDescription": "Démarré comme un moyen d'automatiser et de faciliter mes tâches quotidiennes avec un outil VBA que j'ai conçu et amélioré au fil du temps, ce projet a évolué pour devenir un élément central dans l'optimisation des processus de migration de données chez un éditeur de logiciels immobiliers.\n\n Grâce à l'apprentissage autodidacte et au mentorat de développeurs expérimentés, j'ai progressivement étendu mes compétences au développement web, aboutissant à la création d'un questionnaire en ligne en PHP. Cette réalisation a non seulement amélioré l'efficacité opérationnelle de mon équipe mais a également marqué un tournant décisif dans ma carrière, me convaincant de la valeur de ma passion pour le développement et m'incitant à entreprendre une reconversion professionnelle en développement web.\n\n Ce parcours illustre mon engagement envers l'apprentissage continu, ma capacité à relever des défis techniques complexes et mon désir de contribuer de manière significative à l'innovation technologique.",
  "project2Chrono1Title": "Automatisation avec VBA Excel",
  "project2Chrono1Description": "J'ai initié mon parcours dans l'automatisation des processus en développant des outils VBA pour Excel, simplifiant les tâches de contrôle et marquant mes premiers pas dans le développement logiciel.",
  "project2Chrono2Title": "Transformation en PDF remplissable",
  "project2Chrono2Description": "Pour améliorer la précision et l'efficacité de la collecte de données, j'ai converti les formulaires papier en documents PDF remplissables, marquant une étape significative vers la digitalisation des processus.",
  "project2Chrono3Title": "Développement et mentorat",
  "project2Chrono3Description": "Sous la guidance de développeurs expérimentés, j'ai élargi mes compétences techniques, explorant le VB.NET et la gestion de bases de données avec MySQL, ce qui a renforcé ma capacité à aborder des solutions plus complexes.",
  "project2Chrono4Title": "Lancement du questionnaire web",
  "project2Chrono4Description": "J'ai conçu et déployé un questionnaire en ligne, en utilisant HTML, CSS personnalisé, PHP, et JavaScript. Cette initiative a automatisé le processus de migration de données, réduisant significativement le temps de traitement et les erreurs.",
  "project2Context": "Intégré au service de migration en 2016, ma mission principale consistait à faciliter le passage des clients, utilisant d'anciennes versions de notre logiciel ou celles de concurrents, vers notre nouvelle gamme.\n\n Ce travail délicat de migration impliquait la conversion et l'intégration des données clients dans un format spécifique (.txt), prêt à être traité par nos outils internes pour une incorporation finale dans une base de données SQLServer.\n\nÀ travers ce processus complexe, j'étais chargé d'assurer la fidélité des données grâce à un système de correspondance précis et des contrôles métier rigoureux, garantissant ainsi une transition fluide et sans erreur pour nos clients.",
  "project2Problem": "Le défi initial résidait dans la nécessité d'automatiser le processus de migration pour nos logiciels de comptabilité immobilière, dans le but de réduire significativement le temps de migration tout en améliorant l'exactitude des contrôles.\n\nFace à un processus largement manuel et chronophage, où chaque donnée devait être méticuleusement convertie et vérifiée pour assurer l'intégrité et la précision exigées dans le domaine comptable, l'impératif d'une solution plus efficiente et fiable devenait évident.",
  "project2Solution1": "Développé une interface personnalisée en VBA pour l'automatisation des contrôles comptables.",
  "project2Solution2": "Approfondi les compétences en VB.NET et SQL sous la guidance de développeurs expérimentés.",
  "project2Solution3": "Lancé un questionnaire web en PHP remplaçant les processus basés sur PDF.",
  "project2Results1": "Réduit le temps de migration des données et le taux d'erreurs de façon significative.",
  "project2Results2": "Implémenté des pratiques de développement modernes avec Azure DevOps.",
  "project2Results3": "Géré le projet de questionnaire web de la conception à la mise en production.",
  "project2demonstrationText":"Prêt à discuter des défis rencontrés et des solutions apportées au cours de ce projet lors d'un entretien."
}