{
  "project2Name": "Project 2 - Riding Cities",
  "project2Theme": "First Steps in HTML Language",
  "project2Brief": "This project aims to introduce the HTML language.",
  "project2Mission": "Internship at Webonzaï as a junior developer, with the first mission to update the Riding Cities website, a skateboarding association. In the absence of the CTO, I autonomously added a section for founding members and updated the schedules for children's and adult classes, significantly improving the site's accessibility and aesthetics.",
  "project2Learning1": "Incorporate elements on a web page using HTML fundamentals",
  "project2Learning2": "Incorporate elements on a web page using HTML fundamentals",
  "project3Name": "Project 3 - Booki",
  "project3Theme": "Create a travel agency's homepage with HTML & CSS",
  "project3Brief": "This project aims to develop skills in HTML and discover CSS with the use of flexbox and Responsive design.",
  "project3Mission": "Integrate the Booki site interface in close collaboration with Sarah, the CTO, and Loïc, the UI designer, respecting the provided mock-ups for desktop, tablet, and mobile versions.",
  "project3Learning1": "Implement a responsive interface with HTML and CSS",
  "project3Learning2": "Set up a front-end development environment",
  "project3Learning3": "Integrate content according to a mock-up with HTML and CSS",
  "project4Name": "Project 4 - OhMyFood",
  "project4Theme": "Enhance a mobile site interface with CSS animations",
  "project4Brief": "This project aims to develop skills in HTML, CSS, learn the use of SASS, and CSS animations for a mobile-first site interface.",
  "project4Mission": "Develop a mobile-first site that lists gourmet restaurant menus, allowing customers to compose their menu in advance for a wait-free user experience.",
  "project4Learning1": "Integrate a design in mobile-first approach",
  "project4Learning2": "Implement CSS animations",
  "project4Learning3": "Version control the project with Git and Github",
  "project5Name": "Project 5 - Print It",
  "project5Theme": "First Steps in JavaScript",
  "project5Brief": "The aim of this project was to get started with JavaScript by developing a dynamic carousel for a static site.",
  "project5Mission": "Transform a static printing site by adding an interactive carousel to showcase various products and services.",
  "project5Learning1": "Program using the fundamentals of JavaScript",
  "project5challenges": "Implementing an automatic image scrolling feature (not initially requested)",
  "project6Name": "Project 6 - Architect's Portfolio - Sophie Bluel",
  "project6Theme": "Create a dynamic web page with JavaScript",
  "project6Brief": "Creation of a portfolio for an interior architect, with a dynamic interface thanks to a REST API.",
  "project6Mission": "Development of a dynamic website to present the work of the architect Sophie Bluel, including a management page for adding and removing projects via an admin interface.",
  "project6Learning1": "Handle user events with JavaScript",
  "project6Learning2": "Manipulate DOM elements with JavaScript",
  "project6Learning3": "Retrieve user data in JavaScript via forms",
  "project6challenges": "Addition of the Drag & Drop feature for image upload (not requested)",
  "project6complement1": "To test this project, you need to retrieve the backend from the repository. Here are the login details:",
  "project6complement2": "Email: `sophie.bluel@test.tld` - Password: `S0phie`",
  "project7Name": "Project 7 - Menu Maker by Qwenta",
  "project7Theme": "Plan your client's website development",
  "project7Brief": "This project involves planning and preparing the development of a 'Menu Maker' tool for restaurateurs, by implementing an agile work methodology.",
  "project7Mission": "Collaborate with the product team to define technical specifications, organize project management, and develop a monitoring system for the 'Menu Maker by Qwenta' project.",
  "project7Learning1": "Present the technical solution",
  "project7Learning2": "Write the technical specifications of a web project based on functional needs",
  "project7Learning3": "Break down features into tasks to prepare for development",
  "project7Learning4": "Implement a technology monitoring method",
  "project7Learning5": "Track the progress of the project using a project management tool",
  "project8Name": "Project 8 - Kasa",
  "project8Theme": "Create a real estate rental web application with React",
  "project8Brief": "This project aims to completely overhaul Kasa's web application for a modern JavaScript stack, using React for the front-end and NodeJS for the back-end.",
  "project8Mission": "Develop the React application by respecting the provided Figma mockups, integrating React components, routes with React Router, and managing global state without an initial back-end.",
  "project8Learning1": "Configure navigation between application pages with React Router",
  "project8Learning2": "Develop website interface elements using React components",
  "project8Learning3": "Implement CSS animations",
  "project8Learning4": "Develop a web interface with Sass",
  "project8Learning5": "Initialize an application with Create React App/Vite.js",
  "project9Name": "Project 9 - Nina Carducci",
  "project9Theme": "Optimize the SEO of a photographer's website",
  "project9Brief": "Optimization of SEO and performance for the website of photographer Nina Carducci, already in production.",
  "project9Mission": "Conduct a global optimization of the site to improve performance and SEO, implement local SEO with Schema.org, add meta tags for social networks, improve site accessibility, and produce an optimization report.",
  "project9Learning1": "Optimize a website's performance",
  "project10Name": "Project 10 - 724 Events",
  "project10Theme": "Debug an event agency's website",
  "project10Brief": "Finalize the website development for the event agency 724 Events, by fixing existing bugs and ensuring all functionalities are working properly.",
  "project10Mission": "Your mission is to identify and correct the bugs reported by 724 Events agency. You also need to complete the missing functionalities according to the provided specifications, while ensuring the website's performance optimization and accessibility.",
  "project10Learning1": "Debug a website using Chrome DevTools",
  "project10Learning2": "Write a test script to test a website",
  "project11Name": "Project 11 - ArgentBank",
  "project11Theme": "Implement the front-end of a banking application with React + Redux",
  "project11Brief": "Setting up a dashboard and access restriction with user authentication",
  "project11Mission": "Your task is to create the dashboard of the banking application using React + Redux. This project involves developing a complex user interface, integrating with an API for authentication and user profile management, and using Redux for global state management of the application.",
  "project11Learning1": "Display backend data on the interface via API calls",
  "project11Learning2": "Configure API routes for client/server communication",
  "project11Learning3": "Implement data management with Redux to ensure front-end functionality",
  "project11challenges": "Deployment of API on MongoDB cloud + use of render (not requested)",
  "project11complement1": "You can create an account or you can use the following login credentials:",
  "project11complement2": "Email: `tony@stark.com` - Password: `password123`",
  "project11complement3": "Email: `steve@rogers.com` - Password: `password456`",
  "project11complement4": "in case of connection problems, click on this link to restart the api: https://argentbankapi.onrender.com/"
}
