{
  "developementInProgress": "Development In Progress",
  "developpementCompleted": "Completed",
  "project1Name": "My Personal Budget",
  "project1ShortDescription": "From Excel in 2016 to a web application in 2023: discover My Personal Budget, reflecting my evolution in web development.",
  "project1LongDescription": "My personal project, initiated in 2016 under the name of Personal Account Management with an Excel tool for managing my finances, transformed in July 2023 into a web application, now called My Personal Budget.\n\nThis evolution marks the fruit of my self-taught efforts, enhanced by a web development training focused mainly on the front-end. This transition illustrates my progress and my ability to apply the skills acquired in a tangible way.\n\nThe completion of Version Web 1.0.0 during my training represents a realization of this learning. I designed and developed this project entirely, from front-end to back-end, and ensure its hosting on my personal NAS server.\n\nThis approach demonstrates my total commitment and versatility in all aspects of development. Browse this timeline to see the evolution of My Personal Budget and discover the various skills I have developed along the way.",
  "project1Image1Title": "Login screen view",
  "project1Image2Title": "View of the Entry List screen - All accounts",
  "project1Image3Title": "View of the Entry List screen - Account xxxx",
  "project1Image4Title": "View of the Accounting Entry Creation screen",
  "project1Chrono1Title": "Excel file with formulas",
  "project1Chrono1Description": "Version 1.0.0 is a simple Excel file equipped with complex formulas for the monthly management of income and expenses.",
  "project1Chrono1Image1Title": "Excel login screen view",
  "project1Chrono2Title": "Use of macros with userforms and connection to an Access database.",
  "project1Chrono2Description": "Version 1.1.0 marks a major turning point, transforming the application into an advanced Excel project linked to a structured Access database with about 40 tables. This update introduces a two-person collaboration, consolidating all the necessary features for effective management.",
  "project1Chrono2Image1Title": "Login screen view",
  "project1Chrono3Title": "Conversion to web format to practice my skills, using HTML-SASS-JS for the Front-End and PHP/MySQL for the Back-End.",
  "project1Chrono3Description": "Version 0.1 initiates the transition of the project to a web platform, exploiting HTML, SASS, JS for the front-end and PHP/MySQL for the back-end, based on the original structure of the Excel version. This step marks the beginning of applying my web development knowledge to a concrete project, with the implementation of essential functionalities.",
  "project1Chrono3Image1Title": "Login screen view",
  "project1Chrono4Title": "Migration to React with Vite.js and creation of an API for the Back-End.",
  "project1Chrono4Description": "Version 0.5 transforms the application through the adoption of React and Vite.js, optimizing the user interface and overall performance. The main screens have been redeveloped, incorporating only essential functionalities, and an API for the back-end has been set up. A major innovation is the introduction of Redux, chosen after a thorough evaluation of its impact against the complexity of accounting data. This strategic choice, resulting from comparative tests with and without Redux, ensures more efficient state management and better project maintainability.",
  "project1Chrono4Image1Title": "Login screen view",
  "project1Chrono5Title": "Transformation of PHP API into an API with the Laravel framework.",
  "project1Chrono5Description": "Version 0.8 marks the transition of our API from pure PHP to Laravel, improving security and efficiency with Axios for requests. This evolution has strengthened our back-end and maintained consistent state management with Redux. A notable challenge was deploying the API on my personal NAS, requiring a specific technical adaptation to ensure a smooth and secure integration.",
  "project1Chrono5Image1Title": "Login screen view",
  "project1Chrono6Title": "Demo Version",
  "project1Chrono6Description": "The Web Version 1.0.0 is my first public demonstration version, presenting an interactive user interface designed with React and improved performance thanks to Vite.js. This version initiates essential functionalities for effective management, allowing the creation, modification, and deletion of manual or recurring entries. Although not all functionalities from the original Excel version have been implemented yet, this iteration is based on a robust back-end architecture via Laravel, and an optimized state management with Redux. It's an important step that demonstrates the viability and potential of the web application for concrete use. Work continues to enrich this platform and gradually integrate all the envisioned functionalities.",
  "project1Chrono6Image1Title": "View of the login screen",
  "featureBankAccountManagementTitle": "Personal Bank Account Management",
  "featureBankAccountManagementDescription": "Up to 5 account types: Checking - Deferred - Joint, and 5 Savings accounts.",
  "featureJointAccountTitle": "Joint Account",
  "featureJointAccountDescription": "Available for designated users, while other accounts are individual.",
  "featureAccountingEntriesTitle": "Accounting Entries Recording",
  "featureAccountingEntriesDescription": "Income or Expenses.",
  "featureAccountReconciliationTitle": "Accounting Entries Reconciliation",
  "featureAccountReconciliationDescription": "Ability to reconcile entries for bank reconciliation.",
  "featureEntriesSharingTitle": "Entries Sharing",
  "featureEntriesSharingDescription": "Between 2 users.",
  "featureSettingsScreensTitle": "Settings Screens",
  "featureSettingsScreensDescription": "Manage and configure various settings for the application.",
  "featureEntriesValidationTitle": "Entries Validation",
  "featureEntriesValidationDescription": "Validation of entries over a period after bank reconciliation and execution of account closures.",
  "featureAccountClosureTitle": "Accounting Period Closure",
  "featureAccountClosureDescription": "Over a period after bank reconciliation and execution of account closures.",
  "comingSoon": "Coming Soon",
  "entryTypeTitle": "Entry Type",
  "entryTypeDescription": "Income or Expenses.",
  "categoriesTitle": "Categories",
  "categoriesDescription": "Group, Category (linked to an Account), Sub-Category, Detail.",
  "recurringEntriesTitle": "Recurring Entries",
  "recurringEntriesDescription": "Ability to define recurring entries and automatic debits.",
  "automaticTransfersTitle": "Automatic Transfers",
  "automaticTransfersDescription": "Creation of automatic entries between 2 existing accounts in the software (same user or different).",
  "sharingStatusTitle": "Sharing Status",
  "sharingStatusDescription": "Tracking table for performed shares",
  "reconciliationStatusTitle": "Bank Reconciliation Status",
  "reconciliationStatusDescription": "Tracking table for validated periods",
  "healthSpendingTrackingTitle": "Health Spending Tracking",
  "healthSpendingTrackingDescription": "Tracking table and Health type elements to check reimbursements.",
  "provisionsTrackingTitle": "Provisions Tracking",
  "provisionsTrackingDescription": "Tracking table and elements of type Provisions",
  "ordersTrackingTitle": "Orders Tracking",
  "ordersTrackingDescription": "Tracking table and elements of type Orders",
  "project1demonstrationText": "I can give you a demo of the tool, provide you with login details for a test account, or give you access to my code via GitHub.",
  "apiDocumentationTitle": "See the API documentation",
  "projectVersionTitle": "See the version (Vite.js + Redux + Laravel API)",
  "githubCodeTitle": "Code on GitHub",
  "project2Name": "Freelance Website",
  "project2ShortDescription": "Discover my Freelance website, a showcase of my web development skills and professional commitment.",
  "project2LongDescription": "My Freelance website is the culmination of my journey as an independent web developer. Designed to present my services and achievements, this site demonstrates my expertise and ability to create modern and efficient web solutions.\n\nVersion 1.0.0 marks the launch of the homepage, highlighting the services I offer. Every section of the site has been developed with great attention to detail and user experience, reflecting my professionalism and commitment to my clients.\n\nBrowse this site to discover my portfolio, the projects I have completed, and client testimonials. My goal is to provide high-quality services and build long-lasting relationships with my clients. Feel free to contact me to discuss your web development needs.",
  "project2Image1Title": "Homepage View",
  "project2Image2Title": "Login screen view",
  "project2Chrono1Title": "Version 1.0.0 Launch",
  "project2Chrono1Description": "Version 1.0.0 marks the implementation of the homepage with the proposed services.",
  "project2Chrono1Image1Title": "Homepage View",
  "feature2Title1": "Service Offerings",
  "feature2Description1": "Presentation of the various web development services I offer, ranging from website creation to maintenance and updates.",
  "feature2Title2": "Contact Form",
  "feature2Description2": "An intuitive contact form that allows potential clients to easily reach out for service requests or consultations.",
  "feature2Title3": "Client Space Creation",
  "feature2Description3": "Development of personalized and secure client spaces where users can manage their information and access specific resources.",
  "feature2Title4": "Upcoming Dashboard",
  "feature2Description4": "Future development of an interactive dashboard allowing clients to track the status of their projects in real-time.",
  "project2demonstrationText": "This project is currently in a private repository. Upon request, I can grant you access to the code via GitHub.",
  "project3Name": "AutoStreet",
  "project3ShortDescription": "Discover AutoStreet, a comprehensive website created by David CHANGEA for an automotive garage, with a backend we developed together.",
  "project3LongDescription": "AutoStreet is a project aimed at providing a complete web solution for an automotive garage with an admin interface allowing the garage owner to directly update the site. As a member of the development team, I contributed to the backend development using Laravel, ensuring efficient data management and optimal site performance.\n\nVersion 1.0.0 marks the launch of the homepage, showcasing the services offered by the garage and facilitating the updating of listings and services provided. This project allowed me to apply my backend development skills, particularly in database management, secure API implementation, and server maintenance.\n\nExplore AutoStreet to see how we created a user-friendly and high-performance platform tailored to the specific needs of the garage. This project demonstrates our ability to work as a team and deliver high-quality solutions for our clients.",  
  "project3Image1Title": "Homepage View",
  "project3Image2Title": "Login screen view",
  "project3Chrono1Title": "Version 1.0.0 Launch",
  "project3Chrono1Description": "Version 1.0.0 includes the implementation of the homepage with the proposed services and online appointment booking.",
  "project3Chrono1Image1Title": "Homepage View",
  "feature3Title1": "Service Offerings",
  "feature3Description1": "Presentation of the services offered by the garage, including repairs, maintenance, and vehicle customization.",
  "feature3Title2": "Admin Dashboard",
  "feature3Description2": "A comprehensive admin dashboard to manage car listings, services, clients, and employees.",
  "feature3Title3": "Car Listings",
  "feature3Description3": "Allows the administrator to create and manage car sale listings, with detailed descriptions and photos.",
  "feature3Title4": "Contact Information",
  "feature3Description4": "Clear and accessible contact information, allowing clients to easily reach the garage for inquiries or appointments.",
  "project3demonstrationText": "This project is currently in a private repository. Upon request, I can grant you access to the code via GitHub.",
  "project4Name": "Data Migration Process Optimization",
  "project4ShortDescription": "From automating processes in VBA to creating a web tool in PHP, this project embodies my initiation into development and my transition towards a web development career, highlighting my capacity to innovate and professionally reinvent myself.",
  "project4LongDescription": "Started as a means to automate and facilitate my daily tasks with a VBA tool I designed and improved over time, this project evolved to become a central element in optimizing the data migration processes for a real estate software publisher.\n\nThrough self-learning and mentoring from experienced developers, I gradually expanded my web development skills, culminating in the creation of an online questionnaire in PHP. This achievement not only improved the operational efficiency of my team but also marked a decisive turning point in my career, convincing me of the value of my passion for development and encouraging me to undertake a professional reconversion into web development.\n\nThis journey illustrates my commitment to continuous learning, my ability to tackle complex technical challenges, and my desire to make a significant contribution to technological innovation.",
  "project4Chrono1Title": "Automation with VBA Excel",
  "project4Chrono1Description": "I began my journey in process automation by developing VBA tools for Excel, simplifying control tasks and marking my first steps into software development.",
  "project4Chrono2Title": "Conversion to Fillable PDF",
  "project4Chrono2Description": "To enhance the accuracy and efficiency of data collection, I converted paper forms into fillable PDF documents, marking a significant step towards the digitalization of processes.",
  "project4Chrono3Title": "Development and Mentoring",
  "project4Chrono3Description": "Under the guidance of experienced developers, I expanded my technical skills, exploring VB.NET and database management with MySQL, which strengthened my ability to tackle more complex solutions.",
  "project4Chrono4Title": "Launch of the Web Questionnaire",
  "project4Chrono4Description": "I designed and deployed an online questionnaire, using custom HTML, CSS, PHP, and JavaScript. This initiative automated the data migration process, significantly reducing processing time and errors.",
  "project4Context": "Integrated into the migration service in 2016, my main mission was to facilitate the transition of clients using older versions of our software or those of competitors to our new range.\n\nThis delicate migration work involved converting and integrating client data into a specific format (.txt), ready to be processed by our internal tools for final incorporation into a SQLServer database.\n\nThroughout this complex process, I was responsible for ensuring data fidelity through a precise matching system and strict business controls, thus guaranteeing a smooth and error-free transition for our clients.",
  "project4Problem": "The initial challenge lay in the need to automate the migration process for our real estate accounting software, with the aim of significantly reducing migration time while improving the accuracy of checks.\n\nFaced with a largely manual and time-consuming process, where each piece of data had to be meticulously converted and verified to ensure the integrity and precision required in the accounting field, the imperative for a more efficient and reliable solution became clear.",
  "project4Solution1": "Developed a custom VBA interface for the automation of accounting checks.",
  "project4Solution2": "Deepened skills in VB.NET and SQL under the guidance of experienced developers.",
  "project4Solution3": "Launched a web questionnaire in PHP, replacing PDF-based processes.",
  "project4Results1": "Significantly reduced data migration time and error rate.",
  "project4Results2": "Implemented modern development practices with Azure DevOps.",
  "project4Results3": "Managed the web questionnaire project from design to production.",
  "project4demonstrationText": "Ready to discuss the challenges faced and the solutions provided during this project in an interview."
}