[
  {
    "id": 1,
    "name": "Mon Budget Perso",
    "description": "Mon projet personnel, débuté en 2016 avec un outil Excel pour la gestion de mes finances, a évolué en une application web depuis juillet 2023. Cette transformation, fruit de mes efforts autodidactes et de ma formation en développement web, démontre ma progression et l'application concrète de mes compétences. Explorez cette frise chronologique pour découvrir son évolution et les compétences variées que j'ai acquises.",
    "languages": [
      { "name": "HTML"},
      { "name": "CSS"},
      { "name": "SASS" },
      { "name": "JS" },
      { "name": "REACT" },
      { "name": "VITE.JS" },
      { "name": "REDUX" },
      { "name": "API" },
      { "name": "SWAGGER"},
      { "name": "PHP" },
      { "name": "MYSQL" },
      { "name": "PHPMYADMIN" }, 
      { "name": "LARAVEL" }
    ],
    "images": [
      {
        "titre": "Vue de l'écran de connexion ",
        "nomimage": "view-login.webp"
      },
      {
        "titre": "Vue de l'écran Liste Saisie - Tous les comptes",
        "nomimage": "view-list.webp"
      },
      {
        "titre": "Vue de l'écran Liste Saisie - Compte xxxx",
        "nomimage": "view-account.webp"
      },
      {
        "titre": "Vue de l'écran Création d'écriture comptable",
        "nomimage": "view-create.webp"
      }
    ],
    "fonctionnalites": [
      "Gestion de comptes bancaires personnels (jusqu'à 5 comptes Courant-Différé-Joint et 5 comptes Épargne).",
      "Saisies d'écritures comptables de Revenus ou de Dépenses.",
      "Partage des écritures entre 2 utilisateurs.",
      "Compte Joint utilisable par les utilisateurs définis, tandis que les autres comptes sont individuels.",
      "Validation des écritures sur une période après rapprochement bancaire et réalisation de clôtures d'exercices."
    ],
    "detailsEcritures": [
      "Type de saisie : Revenus ou Dépenses.",
      "Groupe, Catégorie (rattachée à un Compte), Sous-Catégorie, Détail.",
      "Possibilité de définir des écritures récurrentes et des prélèvements automatiques.",
      "Création d'écritures automatiques entre 2 comptes existants dans le logiciel (même utilisateur ou différent)."
    ],
    "demonstration": "Je peux vous faire une démonstration de l'outil, vous donner les paramètres de connexion pour un compte test ou vous donner accès à mon code via GitHub.",
    "lienProjet": "https://fabwebprojects.fr/Mon_Budget_Perso/connexion.php"
  }
]